app/views/yachts/show.html.slim

SELECT "photos".* FROM "photos" WHERE "photos"."type" IN ('Cover') AND "photos"."yacht_id" IN (1)
---
                a href=@yacht.cover.photo_url = @yacht.cover.thumb
                - @yacht.photos.each do |p|